In [115]:
import pandas as pd
from sklearn.preprocessing import StandardScaler

In [117]:
#SAMPLE DATA

In [119]:
df=pd.DataFrame({
    'Age': [25,30, None, 22, 40],
    'Income' : [50000, 60000, 55000, None , 52000],
    'Country' : ['USA', 'Canada', 'USA', 'UK', 'USA']
})

In [121]:
df

    Age   Income Country
0  25.0  50000.0     USA
1  30.0  60000.0  Canada
2   NaN  55000.0     USA
3  22.0      NaN      UK
4  40.0  52000.0     USA

In [123]:
# 1. Handling missing values
df['Age'].fillna(df['Age'].mean(), inplace=True)

C:\Users\C-DAC\AppData\Local\Temp\ipykernel_22636\4116007862.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

In [125]:
df

     Age   Income Country
0  25.00  50000.0     USA
1  30.00  60000.0  Canada
2  29.25  55000.0     USA
3  22.00      NaN      UK
4  40.00  52000.0     USA

In [127]:

df['Income'].fillna(df['Income'].median(), inplace=True)

C:\Users\C-DAC\AppData\Local\Temp\ipykernel_22636\3974383202.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Income'].fillna(df['Income'].median(), inplace=True)

In [129]:
df

     Age   Income Country
0  25.00  50000.0     USA
1  30.00  60000.0  Canada
2  29.25  55000.0     USA
3  22.00  53500.0      UK
4  40.00  52000.0     USA

In [131]:
# 2. Encoding categorical values
df = pd.get_dummies(df, columns=['Country'])

In [133]:
df

     Age   Income  Country_Canada  Country_UK  Country_USA
0  25.00  50000.0           False       False         True
1  30.00  60000.0            True       False        False
2  29.25  55000.0           False       False         True
3  22.00  53500.0           False        True        False
4  40.00  52000.0           False       False         True

In [135]:
# 3. Standardizing numerical values
scaler = StandardScaler()
df[['Age', 'Income']] = scaler.fit_transform(df[['Age', 'Income']])

In [137]:
df

        Age    Income  Country_Canada  Country_UK  Country_USA
0 -0.695414 -1.212190           False       False         True
1  0.122720  1.744372            True       False        False
2  0.000000  0.266091           False       False         True
3 -1.186295 -0.177394           False        True        False
4  1.758989 -0.620878           False       False         True

In [141]:
#LOAD NECESSARY LIBRARY